In [1]:
import pandas as pd
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
df_data=pd.read_csv(data_url, sep='\s+', header=None)
df_data.columns=['CRIM','ZN','INDUS','CHAS','NOX','RM','AGE','DIS','RAD','TAX','PTRATIO','B','LSTAT','MEDV']
#14개 항목의 feature 이름을 지을 수 있다.
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [2]:
from pandas import Series, DataFrame
import pandas as pd
example_obj=Series()

In [6]:
list_data=[1,2,3,4,5]
list_name=["a","b","c","d","e"]
example_obj=Series(data=list_data, index=list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [18]:
dict_data={"a":1,"b":2,"c":3,"d":4,"e":5}
import numpy as np
example_obj=Series(dict_data, dtype=np.float, name="example_data")
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float64

In [19]:
example_obj["a"]
example_obj["a"]=3.2
example_obj["a"]

3.2

In [21]:
example_obj.values

array([3.2, 2. , 3. , 4. , 5. ])

In [22]:
example_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [23]:
example_obj.name = "number"
example_obj.index.name="alphabet"
example_obj

alphabet
a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: number, dtype: float64

In [25]:
dict_data_1={"a":1,"b":2,"c":3,"d":4,"e":5}
indexes=["a","b","c","d","e","f","g","h"]
series_obj_1=Series(dict_data, index=indexes, dtype=float, name="example_data")
series_obj_1

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
Name: example_data, dtype: float64

In [26]:
example_obj[example_obj>2]

alphabet
a    3.2
c    3.0
d    4.0
e    5.0
Name: number, dtype: float64

In [35]:
raw_data = {'first_name':['Jason', 'molly', 'tina', 'Jake', 'Amy'],
           'age':[42,52,36,24,73]}
df=pd.DataFrame(raw_data, columns=['first_name','age','deft'])
df

  first_name  age deft
0      Jason   42  NaN
1      molly   52  NaN
2       tina   36  NaN
3       Jake   24  NaN
4        Amy   73  NaN

In [36]:
df.age

0    42
1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [37]:
df["first_name"]

0    Jason
1    molly
2     tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [39]:
df.loc[1]

first_name    molly
age              52
deft            NaN
Name: 1, dtype: object

In [41]:
df["age"].iloc[1:]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [43]:
s=pd.Series(np.nan, index=[49,48,47,46,1,2,3,4,5])
s.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [44]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

In [47]:
df.T

                0      1      2      3     4
first_name  Jason  molly   tina   Jake   Amy
age            42     52     36     24    73
deft         True   True  False  False  True

In [48]:
df.values

array([['Jason', 42, True],
       ['molly', 52, True],
       ['tina', 36, False],
       ['Jake', 24, False],
       ['Amy', 73, True]], dtype=object)

In [49]:
df.to_csv()

',first_name,age,deft\n0,Jason,42,True\n1,molly,52,True\n2,tina,36,False\n3,Jake,24,False\n4,Amy,73,True\n'

In [56]:
pop ={'Nevada' : {2001:2.4, 2002:2.9},'Ohio' : {2000:1.5, 2001:1.7, 2002:3.6}}
DataFrame(pop)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [60]:
!conda install --y xlrd

Solving environment: ...working... done

# All requested packages already installed.

==> WARNING: A newer version of conda exists. <==
  current version: 4.4.10
  latest version: 4.5.4

Please update conda by running

    $ conda update -n base conda

In [65]:
#df=pd.read_excel("./data/excel-comp-data.xlsx")
df.head()

  first_name  age   deft
0      Jason   42   True
1      molly   52   True
2       tina   36  False
3       Jake   24  False
4        Amy   73   True

In [62]:
#df[["account","street","state"]].head()

In [68]:
s1=Series(range(1,6),index=list("abcde"))
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [70]:
s2=Series(range(6,11),index=list("bcdef"))
s2

b     6
c     7
d     8
e     9
f    10
dtype: int64

In [71]:
s1.add(s2)

a     NaN
b     8.0
c    10.0
d    12.0
e    14.0
f     NaN
dtype: float64

In [72]:
s1.add(s2, fill_value=0)

a     1.0
b     8.0
c    10.0
d    12.0
e    14.0
f    10.0
dtype: float64

In [73]:
df1=DataFrame(np.arange(9).reshape(3,3), columns=list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [74]:
df2=DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [75]:
df1+df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [76]:
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [77]:
df=DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
s=Series(np.arange(10,14), index=list("abcd"))
df+s

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [83]:
df=DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
s2=Series(np.arange(10,14))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [84]:
s2

0    10
1    11
2    12
3    13
dtype: int32

In [81]:
df.add(s2,axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

In [86]:
f=lambda x,y:x+y
f(1,4)

5

In [88]:
(lambda x:x+1)(2)

3

In [95]:
ex=[1,2,3,4,5]
f=lambda x:x**2
list(map(f,ex))

[1, 4, 9, 16, 25]

In [96]:
f=lambda x,y:x+y
list(map(f,ex,ex))

[2, 4, 6, 8, 10]

In [97]:
list(map(lambda x:x+x,ex))

[2, 4, 6, 8, 10]

In [103]:
s1=Series(np.arange(10))
s1.map(lambda x:x**2).head()

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [105]:
z={1:'A',2:'B',3:'C'}
s1.map(z).head()
s2=Series(np.arange(10,20))
s1.map(s2).head()

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [106]:
s2

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [107]:
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32